import matplotlib.pyplot as plt

# Дані для побудови кругової діаграми (припустимі значення у відсотках)
labels = ['Дівчата', 'Хлопці']
sizes = [60, 40]  # Наприклад, 60% дівчат і 40% хлопців
colors = ['lightcoral', 'lightskyblue']  # Колір секторів діаграми
explode = (0.1, 0)  # Виокремлення (розширення) сектора "Дівчата"

# Побудова кругової діаграми
plt.pie(sizes, explode=explode, labels=labels, colors=colors, autopct='%1.1f%%', startangle=140)

# Додавання заголовку діаграми
plt.title('Склад класу за статевою ознакою')

# Відображення кругової діаграми
plt.axis('equal')  # Забезпечення відображення діаграми у формі кола
plt.show()
