# Створення списку даних про учнів
students = [
    {"прізвище": "Іванов", "ім'я": "Петро", "по батькові": "Олександрович", "дата народження": (2005, 3, 15), "стать": "чоловік"},
    {"прізвище": "Петрова", "ім'я": "Олена", "по батькові": "Ігорівна", "дата народження": (2006, 5, 10), "стать": "жінка"},
    {"прізвище": "Сидоренко", "ім'я": "Андрій", "по батькові": "Васильович", "дата народження": (2005, 4, 5), "стать": "чоловік"},
    {"прізвище": "Коваленко", "ім'я": "Марія", "по батькові": "Петрівна", "дата народження": (2006, 3, 20), "стать": "жінка"},
    {"прізвище": "Павленко", "ім'я": "Олексій", "по батькові": "Іванович", "дата народження": (2005, 3, 25), "стать": "чоловік"},
    {"прізвище": "Мельник", "ім'я": "Софія", "по батькові": "Михайлівна", "дата народження": (2006, 5, 5), "стать": "жінка"},
    {"прізвище": "Бойко", "ім'я": "Василь", "по батькові": "Петрович", "дата народження": (2005, 5, 30), "стать": "чоловік"},
    {"прізвище": "Козлова", "ім'я": "Наталія", "по батькові": "Андріївна", "дата народження": (2006, 3, 10), "стать": "жінка"},
    {"прізвище": "Гончар", "ім'я": "Дмитро", "по батькові": "Максимович", "дата народження": (2005, 4, 15), "стать": "чоловік"},
    {"прізвище": "Шевченко", "ім'я": "Катерина", "по батькові": "Олегівна", "дата народження": (2006, 4, 25), "стать": "жінка"},
    # Додайте інших учнів до списку
]

# Запит користувача для введення місяця
input_month = int(input("Введіть номер місяця (1-12): "))

# Пошук та виведення учнів з днем народження у вказаному місяці
found_students = False  # Флаг, що показує, чи знайдено учнів

for student in students:
    birth_month = student["дата народження"][1]  # другий елемент кортежу - номер місяця
    if birth_month == input_month:
        print("{} {} народився у вказаному місяці.".format(student['ім\'я'], student['прізвище']))
        found_students = True

if not found_students:
    print("Учнів, які народилися у вказаному місяці, не знайдено.")
