import datetime

# Функція для перевірки, чи сьогодні день народження
def перевірити_день_народження(учень):
    сьогодні = datetime.date.today()
    дата_народження = учень.get("дата_народження")
    return дата_народження.month == сьогодні.month and дата_народження.day == сьогодні.day

# Створення пустого словника для зберігання інформації про учнів
учні_словник = {}

# Введення інформації про учнів
кількість_учнів = int(input("Введіть кількість учнів: "))

for номер_учня in range(1, кількість_учнів + 1):
    прізвище = input(f"Прізвище учня {номер_учня}: ")
    ім_я = input(f"Ім'я учня {номер_учня}: ")
    по_батькові = input(f"По батькові учня {номер_учня}: ")
    рік = int(input(f"Рік народження учня {номер_учня}: "))
    місяць = int(input(f"Місяць народження учня {номер_учня}: "))
    день = int(input(f"День народження учня {номер_учня}: "))

    дата_народження = datetime.date(рік, місяць, день)

    учень = {
        "прізвище": прізвище,
        "ім'я": ім_я,
        "по батькові": по_батькові,
        "дата_народження": дата_народження,
    }
    
    # Записуємо учня до словника
    учні_словник[номер_учня] = учень

# Перевірка днів народжень
сьогодні_дні_народження = []

for номер_учня, учень in учні_словник.items():
    if перевірити_день_народження(учень):
        print("Сьогодні святкують день народження:")
        print(учень["ім'я"] + " " + учень["прізвище"])
        сьогодні_дні_народження.append(учень)

# Виведення результату
if сьогодні_дні_народження:
    print("Сьогодні святкують день народження:")
    for учень in сьогодні_дні_народження:
        print(учень["ім'я"] + " " + учень["прізвище"])
else:
    print("Сьогодні ніхто не святкує день народження.")
